[{"subject":"ENGL","number":"1001","title":"Engl as a Second Lang I","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"1002","title":"Engl as a Second Lang II","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"1010","title":"English Composition I","description":"Introduces students to expressive, expository and persuasive writing. Assignments are based on personal experience and research. Student must earn a grade of C or better to pass. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: General Education-English, No Drop Allowed Prerequisites: Prereq for ENGL1010 General Requirements: ( Course or Test: UNIV 1100 Minimum Grade of D May be taken concurrently. ) or ( Course or Test: DSPW 0800 Minimum Grade of C May not be taken concurrently. ) or ( DSPW 4 May not be taken concurrently. ) or ( A01 18 to 36 May not be taken concurrently. ) or ( S07 390 to 450 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"1020","title":"English Composition II","description":"Prerequisite: ENGL 1010. Builds on writing and research processes taught in ENGL 1010; emphasizes critical reading, critical thinking, and critical writing (persuasion) about a variety of written texts and other media. Student must earn a grade of C or better to pass. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: General Education-English, No Drop Allowed, Service Learning 1 Prerequisites: Prereq for ENGL1020 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"1030","title":"Literary Studies Abroad","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"1110","title":"Research Writing Methods","description":"1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":1},{"subject":"ENGL","number":"1113","title":"Introduction to Research","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"1114","title":"Technical Editing","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"2035","title":"Introduction to Fiction","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"2045","title":"Introduction to Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Prerequisites: Prereq for ENGL2045 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2055","title":"African-American Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"2110","title":"Early American Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2110 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2112","title":"Technical Report Writing","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Prerequisites: Prereq for ENGL2112 General Requirements: Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"2114","title":"Writing for Industry","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Prerequisites: Prereq for ENGL2114 General Requirements: Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"2116","title":"Writing for the Web","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort","credits":3},{"subject":"ENGL","number":"2120","title":"Modern American Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2120 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2130","title":"Topics in American Literature","description":"Prerequisite: ENGL 1020 with a grade of C or better. Not for ENG or SEEN majors. Representative authors, periods, or themes from the colonial period to the present. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Gen Ed-Humanities/Fine Arts Prerequisites: Prereq for ENGL2130 General Requirements: ( Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2210","title":"Early British Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2210 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2220","title":"Modern British Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2220 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2235","title":"Topics in British Literature","description":"Prerequisite: ENGL 1020 with a grade of C or better. Not for ENG majors. Representative authors, periods, or themes from Old English to the present. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be enrolled in one of the following Majors: English Prerequisites: Prereq for ENGL2235 General Requirements: ( Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"230","title":"Creative Writing","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"2300","title":"Creative Writing","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort","credits":3},{"subject":"ENGL","number":"2310","title":"Early World Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2310 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of D May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2320","title":"Modern World Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Prerequisites: Prereq for ENGL2320 General Requirements: ( Course or Test: ENGL 1020 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2330","title":"Topics in World Literature","description":"Prerequisite: ENGL 1020 with a grade of C or better. Representative authors, periods, or themes from various world literary cultures. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Gen Ed-Humanities/Fine Arts Prerequisites: Prereq for ENGL2330 General Requirements: ( Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2410","title":"Early European Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2410 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"2420","title":"Modern European Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Course Attributes: Gen Ed-Humanities/Fine Arts Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2420 General Requirements: Course or Test: ENGL 1010 to 1020 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"2430","title":"Topics in European Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department","credits":3},{"subject":"ENGL","number":"2630","title":"Literature for Children","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL2630 General Requirements: Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"2810","title":"British Literature I","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"2820","title":"British Literature II","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"2910","title":"American Literature I","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"2920","title":"American Literature II","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"3000","title":"Intro/Engl Method-Resrch","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130 , ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Basic sources, research methodology, critical theory, and writing processes/formats needed by majors. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL3000 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3134","title":"Computer/Writing/Lit","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort","credits":3},{"subject":"ENGL","number":"3150","title":"Lit/Ethnics \u0026 Values-ETSU","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Undeclared Department","credits":3},{"subject":"ENGL","number":"3250","title":"Professional Comm I","description":"Prerequisite:: ENGL 1020. The preparation of effective technical and professional reports and the preparation and delivery of effective oral reports. (Same as PC 3250.) 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prequisite for ENGL3250 General Requirements: Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"3280","title":"Mythology-ETSU","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Undeclared Department","credits":3},{"subject":"ENGL","number":"3290","title":"Intro to Film","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL3290 General Requirements: Course or Test: ENGL 1010 to 1020 Minimum Grade of C May not be taken concurrently.","credits":3},{"subject":"ENGL","number":"3400","title":"Intro to Creative Writing","description":"Prerequisite: At least a grade of C in one sophomore-level literature course (ENGL 2130, 2235, 2330) or a grade of C or better in ENGL3810 or ENGL 3820 or ENGL 3910 or ENGL 3920, or consent of instructor. An introductory-level creative writing course in at least two genres: fiction, poetry, literary nonfiction, or drama. Genres to be determined by the instructor. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENGL3400 General Requirements: ( Course or Test: ENGL 2130 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 3810 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 3820 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 3910 Minimum Grade of C May not be taken concurrently. ) or ( Course or Test: ENGL 3920 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3410","title":"Classical Mythology","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prereq for ENGL3410 General Requirements: ( Course or Test: ENGL 1010 May not be taken concurrently. and Course or Test: ENGL 1020 May not be taken concurrently. ) and ( Course or Test: ENGL 2010 May not be taken concurrently. ) or ( Course or Test: ENGL 2110 May not be taken concurrently. ) or ( Course or Test: ENGL 2120 May not be taken concurrently. ) or ( Course or Test: ENGL 2210 May not be taken concurrently. ) or ( Course or Test: ENGL 2220 May not be taken concurrently. ) or ( Course or Test: ENGL 2410 May not be taken concurrently. ) or ( Course or Test: ENGL 2420 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3500","title":"Mythology","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Greek and Roman myths in relation to modern life and literature. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL3500 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3600","title":"The Bible as Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper-division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. This course examines the wide variety of genres and narratives that form the Bible—from the mythological and genealogical to the poetic and prophetic—and does this from critical, literary, cultural, and rhetorical perspectives. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENG3600 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3730","title":"20th Century Women Writers","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prerequisite for ENGL3730 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of D May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of D May not be taken concurrently. and Course or Test: ENGL 2010 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2110 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2120 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2210 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2220 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2410 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2420 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3810","title":"British Literature I","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. A survey of British authors from Old English through the eighteenth century. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL3810 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3820","title":"British Literature II","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. A survey of British authors from the Romantics to the present. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL3820 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3910","title":"American Literature I","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. A survey of American writers from the colonial period through the mid-nineteenth century. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prequisite for ENGL3910 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"3920","title":"American Literature II","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. A survey of American writers from the mid-nineteenth century through the present. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL3920 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4020","title":"The Gothic Tale of Terror","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"4100","title":"Writing Internet \u0026 Elect Media","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort","credits":3},{"subject":"ENGL","number":"4111","title":"Chaucer","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235, or ENGL 2330 is waived for ENGL and SEEN majors. Selected works of Geoffrey Chaucer. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4111 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4121","title":"Shakespeare","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Historical, thematic and other approaches in the study of Shakespeare. (May be repeated once as an elective provided the course content is different.) 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4121 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4130","title":"Milton","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Selected works of John Milton. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prequisite for ENGL4130 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4140","title":"Topics/British Lit to 1667","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Topics in Medieval and/or Early Modern British literature. Course may be repeated provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prequisites for ENGL4140 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4210","title":"18th Cent British Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies in eighteenth-century British literature. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisites for ENGL4210 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4221","title":"Romantic Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies in Romantic literature. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4221 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4231","title":"Victorian Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies in Victorian literature. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4231 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4240","title":"Topics:British Lit After 1667","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies in Modern British literature. Course may be repeated provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department Prerequisites: Prerequisite for ENGL4240 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4250","title":"Post-Modern Lit/English","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for Upper Division courses of ENGL 2130, ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies in postmodern literary issues. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department Prerequisites: Prerequisite fo ENGL4250 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4310","title":"Early American Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235, or ENGL 2330 is waived for ENGL and SEEN majors. Study of American literature from colonial period through early nationalist period. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department Prerequisites: Prerequisite for ENGL4310 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4320","title":"19th Century American Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Study of the literature and literary movements of the period, with emphasis on romanticism and/or realism. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department","credits":3},{"subject":"ENGL","number":"4330","title":"Modern American Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Study of the literature and literary movements of the period, with emphasis on the twentieth century and/or contemporary period. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4330 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4340","title":"Topics in American Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Thematic, interdisciplinary or genre-based approaches to American literary study beyond the usual scope of ENGL 4310 (5310), ENGL 4320 (5321), or ENGL 4330 (5330). Course may be repeated provided the content is different each time.. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4340 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4411","title":"Writing in the Professions","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. This course builds on students’ present writing competency and focuses on writing in their particular majors and/or professions. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4411 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4421","title":"Forms of Arg \u0026 Pers:Theo/Pract","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Introduces students to various models of argumentation through theory (readings) and practice (analysis and production). 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4421 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4430","title":"Creative Writing: Fiction","description":"Prerequisite: Grade of C or better in ENGL 3400 or prior consent of the instructor. Guided practice in the craft and art of writing short fiction. Course may be repeated provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prereq for ENGL4430 General Requirements: ( Course or Test: ENGL 3400 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4440","title":"Creative Writing: Essay","description":"Prerequisite: Grade of C or better in ENGL 3400 or prior consent of the instructor. Guided practice in the craft and art of writing personal essays. Course may be repeated, provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENGL4440 General Requirements: ( Course or Test: ENGL 3400 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4450","title":"Creative Writing: Poetry","description":"Prerequisite: Grade of C or better in ENGL 3400 or prior consent of the instructor. Guided practice in the craft and art of writing poetry. Course may be repeated provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENGL4450 General Requirements: ( Course or Test: ENGL 3400 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4451","title":"Intro/Rhetoric:Theory \u0026 Pract","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. The course introduces students to rhetoric–history and special topics. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department","credits":3},{"subject":"ENGL","number":"4460","title":"Lit Mag Editing/Iris Review","description":"Prerequisite: Grade of C or better in ENGL 3400 or prior consent of the instructor. Creation of a literary magazine annual edition from initial call for submissions through publication. Course may be repeated one provided the content is different. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENGL 4460 General Requirements: ( Course or Test: ENGL 3400 Minimum Grade of C May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4511","title":"Intro/Descriptive Linguistics","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235, or ENGL 2330 is waived for ENGL and SEEN majors. Introduction to descriptive analysis of language: phonology, morphology, lexicon, and syntax. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisites for ENGL4511 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4521","title":"History-English Language","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235, or ENGL 2330 is waived for ENGL and SEEN majors. History of the language from its origins to the present; emphasis upon historical development of English sounds, word structure, and syntax. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4521 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4531","title":"Grammar and Language","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Grammatical structure of English in relation to dialect and register with some emphasis on historical and potential changes in grammar. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4531 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4541","title":"Topics in Linguistics/Language","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Examination of specific aspects of language and/or linguistic study, such as Old and Middle English, the language of dialect literature or American English dialects. Course may be repeated provided the content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4541 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4561","title":"American English","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. This class will examine American English from multiple cultural and linguistic angles and allow the students to develop their own understanding of how the language around them shapes their lives. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department","credits":3},{"subject":"ENGL","number":"4610","title":"Novel","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Theory of the novel and a study of selected novels. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4610 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4620","title":"Poetry: Form, Genre, Theory","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. The study of poetry written in English and translated from other languages, with attention to such topics as poetic movements, styles, trends, the evolution, and development of forms. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4620 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4630","title":"Literary Criticism and Theory","description":"rerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Historical and thematic studies of critical and theoretical trends and issues. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4630 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4640","title":"Modern \u0026 Contemporary Drama","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Study of dramatic texts and performance issues from the late 19th century to the present. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4640 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4650","title":"The Graphic Novel","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, 2235, and 2330 are prerequisites for all upper-division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL majors and for SEEN majors. Theory of comics-format texts and study of selected graphic novels. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department","credits":3},{"subject":"ENGL","number":"4680","title":"Continental Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort Prerequisites: Prerequisite for ENGL4680 General Requirements: ( Course or Test: ENGL 2000 to 2999 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4700","title":"Non-Western Literature","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture TN eCampus Degree Program Department Restrictions: May not be assigned to one of the following Cohorts: International Cohort","credits":3},{"subject":"ENGL","number":"4712","title":"African American Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies of African American literature and culture, both oral and printed. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4712 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4713","title":"Native American Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies of Native American literature and culture, both oral and printed. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4713 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4720","title":"Continental Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Study of major works and writers from the European continent. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4720 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4731","title":"Approaches to Women \u0026 Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Studies of major women writers or images of women in literature. Course may be repeated provided the course content is different each time. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4731 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4741","title":"Science and Culture","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Cultural influences on scientific discourse and literature about science. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4741 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4751","title":"Topics in Non-Western Lit","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Focuses on literature written outside of European literary traditions, either written in or translated into English. Course may be repeated for credit as long as the topic is different. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4751 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4810","title":"Introduction to Folklore","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2230, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. Generic survey of folklore; possible definitions, varieties, meanings, and methods of study. Stress on verbal traditions (tales, songs, and beliefs). 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4810 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4820","title":"Upper Cumberland Folklore","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130 , ENGL 2230 , and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. Folklore of the Upper Cumberland, with emphasis on relationships between regional material and the broad perspective of the humanities. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4820 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4830","title":"Southern Literature","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Major writers of the South, with emphasis on regional themes and on the Southern literary renaissance. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department","credits":3},{"subject":"ENGL","number":"4840","title":"The Gothic Tale of Terror","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Readings in Gothic poetry and prose. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4840 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4911","title":"The Literature of Science","description":"Prerequisite: ENGL1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2230, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. Topics in literary non-fiction written by scientists. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisites for ENGL4911 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4921","title":"Literature and Technology","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2230 and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. Study of literature which deals with the impact of technology on society. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4921 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4931","title":"Lit and the Environment","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2230 and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2230 or ENGL 2330 is waived for ENGL and SEEN majors. A study, through literature, of the relationship between humans and the environment. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Prerequisites: Prerequisite for ENGL4931 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4950","title":"Topics in Prof/Tech Comm","description":"Prerequisite: ENGL 3250 or PC 3250. In-depth study of topics relevant to the field of Professional and Technical communication. Course may be repeated provided the content is different. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prereq for ENGL4950 General Requirements: ( Course or Test: ENGL 3250 May not be taken concurrently. ) or ( Course or Test: PC 3250 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4970","title":"Professional Comm II","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all Upper Division courses. The prerequisite for Upper Division courses of ENGL 2130, ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. A continuation of ENGL 3250 with emphasis on more complex reports. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4970 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 May not be taken concurrently. ) or ( Course or Test: ENGL 2235 May not be taken concurrently. ) or ( Course or Test: ENGL 2330 May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4980","title":"Topics","description":"3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English and Communications Department","credits":3},{"subject":"ENGL","number":"4981","title":"Topics","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Coursework or directed individual research in any area where there is no other course offering. 1.000 Credit hours 1.000 Other hours Levels: Undergraduate Schedule Types: Independent Study English Department Prerequisites: Prerequisite for ENGL4981 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":1},{"subject":"ENGL","number":"4982","title":"Topics","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Coursework or directed individual research in any area where there is no other course offering. 2.000 Credit hours 2.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4982 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":2},{"subject":"ENGL","number":"4983","title":"Topics","description":"Prerequisite: ENGL 1010 and ENGL 1020 and one course from among ENGL 2130, ENGL 2235, and ENGL 2330 are prerequisites for all upper division courses. The prerequisite for upper-division courses of ENGL 2130 or ENGL 2235 or ENGL 2330 is waived for ENGL and SEEN majors. Coursework or directed individual research in any area where there is no other course offering. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Prerequisites: Prerequisite for ENGL4983 General Requirements: ( Course or Test: ENGL 1010 Minimum Grade of C May not be taken concurrently. and Course or Test: ENGL 1020 Minimum Grade of C May not be taken concurrently. ) and ( Course or Test: ENGL 2130 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2235 Minimum Grade of D May not be taken concurrently. ) or ( Course or Test: ENGL 2330 Minimum Grade of D May not be taken concurrently. )","credits":3},{"subject":"ENGL","number":"4990","title":"Internship","description":"Prerequisites: Junior or senior status, at least two ENGL courses at the 3000-level or above, and consent of the chair or internship coordinator. This course is for English majors only. Part-time employment in a business or institution setting related to a student\u0027s academic and career goals, and contextualized by guided written reflection with a faculty member. Cannot be taken in place of core English courses (ENGL 3000, ENGL 3810, ENGL 3820, ENGL 3910, ENGL 3920, ENGL 4121, ENGL 4995). 3.000 Credit hours 3.000 Other hours Levels: Undergraduate Schedule Types: Internship English Department Course Attributes: Work Based Learning 4 Restrictions: Must be enrolled in one of the following Majors: English Must be enrolled in one of the following Classifications: Senior Junior","credits":3},{"subject":"ENGL","number":"4995","title":"Senior Colloquium","description":"Prerequisites: Senior standing as an English BA major; completion of all required ENGL 3000-level courses. Intensive study of a theme or period selected by the instructor, with an emphasis on research, writing, discussion, and presentation. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture English Department Course Attributes: Undergraduate Research 1 Restrictions: Must be enrolled in one of the following Majors: English Must be enrolled in one of the following Classifications: Senior","credits":3}]