[{"subject":"AGR","number":"1020","title":"Connections to Agriculture","description":"An introduction for agricultural students to the social, educational, economic, and career opportunities, which are available on campus, in the local community, and the broader agricultural industry. 1.000 Credit hours 2.000 Other hours Levels: Undergraduate Schedule Types: Laboratory Agriculture Department Course Attributes: No Drop Allowed Restrictions: Must be enrolled in one of the following Classifications: Freshman","credits":1},{"subject":"AGR","number":"2010","title":"Professional Ldrshp Devl","description":"0.000 OR 3.000 Credit hours 2.000 Lecture hours 2.000 Lab hours Levels: Undergraduate Schedule Types: Laboratory, Lecture Agriculture Department","credits":3},{"subject":"AGR","number":"2020","title":"Strategies for Success","description":"This course is designed to provide students with the tolls needed to persist and succeed in the College of Agriculture and Human Ecology at Tennessee Tech University. Topics covered include: learning styles, study techniques, note-taking, test-taking, personal wellness and finance, effective writing and reading, time management, career and educational planning, and interpersonal skill development. This course does not satisfy requirements for any degree at TTU, it has no prerequisites, is non-transferable, and satisfies one credit towards your total semester credit hours. 1.000 Credit hours 2.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"2022","title":"Professionalism in Agriculture","description":"Appropriate social and professional standards of behavior as applied to the community and workplace environments. 1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"2100","title":"Community Leadership","description":"This course is limited to TN High School Dual Enrollment students. This course serves as an opportunity for high school students participating in the annual School of Agriculture\u0027s Tennessee Leadership Summit to have a greater understanding of leadership as it pertains to their lives and communities. Students will explore leadership models, roles of leaders and followers, concepts of effective leadership, and ethical issues, with special focus on leadership as service in teams, organizations, communities and society. Appropriate social and professional standards of behavior as applied to the community and workplace environments will be explored. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":3},{"subject":"AGR","number":"2890","title":"Mtng Chlnges/Diverse Workplce","description":"This course is designed as an upper division, work-world preparation course. As students ready to leave the relative safety of the cocooned worlds of their chosen disciplines, this course provides practical tools and information necessary to succeed in a diverse and changing world of work. By combining interactive learning, current and relevant readings, and key presenters, the course will help completers integrate more smoothly into the next phase of their lives. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":3},{"subject":"AGR","number":"2910","title":"Work Experience","description":"Supervised on-campus work experience in agriculture. Credit awarded based on 3 hours of work per week during the semester for each hour of credit. Graded S/U only. 1.000 TO 3.000 Credit hours 1.000 TO 3.000 Other hours Levels: Undergraduate Schedule Types: Independent Study Agriculture Department","credits":3},{"subject":"AGR","number":"2920","title":"Work Experience","description":"Supervised on-campus work experience in agriculture. Credit awarded based on 3 hours of work per week during the semester for each hour of credit. Graded S/U only. 1.000 TO 3.000 Credit hours 1.000 TO 3.000 Other hours Levels: Undergraduate Schedule Types: Practicum/Co-op Agriculture Department","credits":3},{"subject":"AGR","number":"2940","title":"Internship","description":"Supervised off-campus work experience program in production agriculture, an agricultural agency of the government or an agribusiness. Credit awarded based on one month full-time employment for each hour of credit or equivalent. Graded S/U only. 1.000 TO 3.000 Credit hours 1.000 TO 3.000 Other hours Levels: Undergraduate Schedule Types: Internship Agriculture Department","credits":3},{"subject":"AGR","number":"2950","title":"Internship","description":"Supervised off-campus work experience program in production agriculture, an agricultural agency of the government or an agribusiness. Credit awarded based on one month full-time employment for each hour of credit or equivalent. Graded S/U only. 1.000 TO 3.000 Credit hours 1.000 TO 3.000 Other hours Levels: Undergraduate Schedule Types: Internship Agriculture Department","credits":3},{"subject":"AGR","number":"2990","title":"Experiential Agriculture","description":"Hands?on learning experience in a variety of agricultural production activities. Experiences may include but are not limited to livestock handling, crop production, landscaping, construction of agricultural structures and data collection and analysis. This is a labratory class that will require six contact hours per week. 3.000 Credit hours 6.000 Lab hours Levels: Undergraduate Schedule Types: Laboratory Agriculture Department","credits":3},{"subject":"AGR","number":"3000","title":"Leadership and Service","description":"This course serves as an opportunity for students to have a greater understanding of leadership as it pertains to their lives. We will explore leadership models, roles of leaders and followers, concepts of effective leadership, and ethical issues, with special focus on leadership as service in teams, organizations, communities, and society. The course is also intended to assist students in identifying and defining leadership on a personal level. Students will earn through reading, observing, applying, creating, and evaluating leadership in an organizational context. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department Course Attributes: Service Learning 2","credits":3},{"subject":"AGR","number":"3200","title":"Study Abroad Exploration","description":"This study abroad program would provide students an avenue to explore global cultures, build sustainable, service learning projects, engage in global dialogues directly related to their degree programs, and hone their communication and critical thinking skills via a plethora of learning opportunities. This course may be repeated. 1.000 TO 6.000 Credit hours 1.000 TO 6.000 Other hours Levels: Undergraduate Schedule Types: Independent Study Agriculture Department","credits":6},{"subject":"AGR","number":"3900","title":"Ldrship Devl/AG Ambassadors","description":"Prerequisite: Consent of instructor. Courses designed to improve leadership skills of AG/HEC Ambassadors. 1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"3901","title":"Ldrship Devl/AG Ambassadors","description":"Prerequisite: Consent of instructor. Courses designed to improve leadership skills of AG/HEC Ambassadors. 1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"3902","title":"Ldrship Devl/AG Ambassadors","description":"Prerequisite: Consent of instructor. Courses designed to improve leadership skills of AG/HEC Ambassadors. 1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"3903","title":"Ldrship Devl/AG Ambassadors","description":"1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":1},{"subject":"AGR","number":"3940","title":"Advanced Internship","description":"Prerequisite: Junior or Senior standing and recommendation of advisor; must conform to departmental guidelines. Supervised off-campus advanced placement program in production agriculture, an agricultural agency of the government or an agribusiness. A minimum of six weeks of full-time work is required to fulfill three credit hours. 3.000 Credit hours 3.000 Other hours Levels: Undergraduate Schedule Types: Internship Agriculture Department Restrictions: Must be enrolled in one of the following Classifications: Senior Junior","credits":3},{"subject":"AGR","number":"3950","title":"Advanced Internship","description":"Prerequisite: Junior or Senior standing and recommendation of advisor; must conform to departmental guidelines. Supervised off-campus advanced placement program in production agriculture, an agricultural agency of the government or an agribusiness. A minimum of six weeks of full-time work is required to fulfill three credit hours. 3.000 Credit hours 3.000 Other hours Levels: Undergraduate Schedule Types: Internship Agriculture Department Restrictions: Must be enrolled in one of the following Classifications: Senior Junior","credits":3},{"subject":"AGR","number":"3960","title":"Advanced Internship","description":"Prerequisite: Junior or Senior standing and recommendation of advisor; must conform to departmental guidelines. Supervised off-campus advanced placement program in production agriculture, an agricultural agency of the government or an agribusiness. A minimum of six weeks of full-time work is required to fulfill three credit hours. 3.000 Credit hours 3.000 Other hours Levels: Undergraduate Schedule Types: Internship Agriculture Department Restrictions: Must be enrolled in one of the following Classifications: Senior Junior","credits":3},{"subject":"AGR","number":"4500","title":"Senior Seminar","description":"Application of leadership and professional skills in Agriculture. Public policy and advocacy guidelines for the professions in Agriculture. 1.000 Credit hours 1.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department Restrictions: Must be enrolled in one of the following Classifications: Senior","credits":1},{"subject":"AGR","number":"4600","title":"Global Food Sys: Sust \u0026 Insc","description":"Relationships of global food systems to environmental and human health. Dynamics of societal issues, population, food production, biodiversity, biotechnology and economics on food insecurity. 3.000 Credit hours 3.000 Lecture hours Levels: Undergraduate Schedule Types: Lecture Agriculture Department","credits":3},{"subject":"AGR","number":"4900","title":"Global Agri Service Lrning","description":"This course is designed to provide students with a forum for critical reflection on community-driven service, intercultural experiences, power and privilege and critical global engagement. Each section is focused on a specific global agricultural immersion experience. 1.000 TO 4.000 Credit hours 1.000 TO 4.000 Other hours Levels: Undergraduate Schedule Types: Independent Study Agriculture Department","credits":4},{"subject":"AGR","number":"4920","title":"Senior Problem","description":"Prerequisite: Senior standing. Supervised research in area of interest to the student including data collection, analysis, interpretation of results and preparation of written report. 3.000 Credit hours 3.000 Other hours Levels: Undergraduate Schedule Types: Independent Study Agriculture Department Restrictions: Must be enrolled in one of the following Classifications: Senior","credits":3}]